<template>
  <v-container>
    <h1 style="color: #1966c0">PS Car Rental</h1>
    <p>
      ระบบบริหารงานรถเช่าเป็นแพลตฟอร์มที่ออกแบบมาเพื่อช่วยให้ธุรกิจรถเช่าจัดการและดำเนินงานได้อย่างมีประสิทธิภาพและเป็นระบบ
      ช่วยให้ผู้ประกอบการสามารถติดตามสถานะของยานพาหนะ ตรวจสอบการจอง และจัดการกับลูกค้าได้ง่ายขึ้น
    </p>

    <h3 class="mt-2">คุณสมบัติหลักของระบบ:</h3>
    <ul class="ml-5">
      <li>
        <strong>การจัดการยานพาหนะ:</strong> ระบบช่วยให้ผู้ใช้สามารถเพิ่มและจัดการข้อมูลยานพาหนะในระบบได้อย่างสะดวก
        รวมถึงการติดตามสถานะของรถเช่า (ว่าง, จองแล้ว, กำลังใช้งาน, ซ่อมบำรุง)
        และการบำรุงรักษายานพาหนะเพื่อให้แน่ใจว่ารถพร้อมใช้งานเสมอ
      </li>
      <li>
        <strong>การจองและการเช่า:</strong> ลูกค้าสามารถทำการจองรถเช่าได้ผ่านทางระบบออนไลน์
        โดยระบบจะจัดการกับตารางเวลาของยานพาหนะและแสดงสถานะที่พร้อมใช้งานในเวลาจริง ผู้ใช้สามารถตรวจสอบและยืนยันการจอง
        รวมถึงติดตามประวัติการเช่าของลูกค้าได้
      </li>
      <li>
        <strong>การจัดการลูกค้า:</strong> ระบบจะเก็บข้อมูลของลูกค้าและประวัติการเช่าทั้งหมด
        ทำให้สามารถตรวจสอบข้อมูลลูกค้าได้อย่างรวดเร็วและจัดการความสัมพันธ์กับลูกค้าได้อย่างมีประสิทธิภาพ
        รวมถึงการส่งการแจ้งเตือนและเอกสารสำคัญให้กับลูกค้า
      </li>
      <li>
        <strong>การออกใบเสร็จและการชำระเงิน:</strong> ระบบรองรับการสร้างใบเสร็จและการจัดการการชำระเงินอัตโนมัติ
        ทำให้ผู้ประกอบการสามารถติดตามการชำระเงินของลูกค้าได้ง่ายขึ้น และจัดการบัญชีของธุรกิจได้อย่างมีประสิทธิภาพ
      </li>
      <li>
        <strong>รายงานและการวิเคราะห์:</strong> ระบบมีฟีเจอร์สำหรับการสร้างรายงานและการวิเคราะห์ข้อมูลต่างๆ เช่น
        รายได้ต่อเดือน จำนวนการเช่าเฉลี่ยต่อวัน สถานะของยานพาหนะ เพื่อช่วยให้ผู้ประกอบการสามารถตัดสินใจได้อย่างแม่นยำ
      </li>
      <li>
        <strong>การรวมกับ API ของบุคคลที่สาม:</strong> ระบบสามารถรวมกับบริการบุคคลที่สาม เช่น ระบบการชำระเงินออนไลน์
        ระบบตรวจสอบประวัติผู้ขับขี่ และการเชื่อมต่อกับโซเชียลมีเดียเพื่อการทำการตลาดและการสื่อสารกับลูกค้าได้อย่างสะดวก
      </li>
    </ul>

    <h3 class="mt-2">ประโยชน์ของระบบ:</h3>
    <ul class="ml-5">
      <li>
        <strong>เพิ่มประสิทธิภาพในการจัดการ:</strong> ช่วยให้การดำเนินงานของธุรกิจรถเช่าเป็นระบบมากขึ้น
        ลดข้อผิดพลาดในการจัดการเอกสารและข้อมูล
      </li>
      <li>
        <strong>ประหยัดเวลาและทรัพยากร:</strong> ลดเวลาที่ใช้ในการจัดการข้อมูลลูกค้าและยานพาหนะ
        ทำให้มีเวลาไปพัฒนาธุรกิจในด้านอื่นๆ มากขึ้น
      </li>
      <li>
        <strong>เพิ่มความพึงพอใจของลูกค้า:</strong> ด้วยระบบการจองและการบริการที่รวดเร็วและแม่นยำ
        ลูกค้าจะได้รับประสบการณ์ที่ดีและมีความพึงพอใจในการใช้บริการ
      </li>
    </ul>
  </v-container>
</template>
<script setup>
definePageMeta({ layout: "home" });
</script>
